app/views/product/available.html.erb

		<td> <%= product.available_from.strftime("%a, %d, %b %Y") %> </td>
		<td> <%= Cat.find(product.category).category_name %> </td>
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 3]]