app/views/product/line_item_details.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
---
<% @orders.each do |order| %>
<h2> Listing product details for Order number: <%= Order.find(order).order_number%> </h2>

SELECT "lineitemnews".* FROM "lineitemnews" WHERE (order_id = 1)
---
		<%# #puts "category = #{cat}" %>
		<%product = Lineitemnew.where('order_id = ?', order) %>

SELECT "orders"."id" FROM "orders"
---
	<% end %>
		<td> <%= product.order_id %> </td>