app/views/product/not_available.html.erb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 1]]
---
		<td> <%= product.available_from.strftime("%a, %d, %b %Y") %> </td>
		<td> <%= Cat.find(product.category).category_name %> </td>