app/views/product/orders_placed.html.erb

	<% end %>
		<td> <%= order.order_date %> </td>
		<td> <%= order.order_number %> </td>
		<td> <%= Lineitemnew.where('order_id = ?',order.id).count %> </td>
---
SELECT "orders".* FROM "orders"
SELECT  "lineitemnews".* FROM "lineitemnews" WHERE "lineitemnews"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "lineitemnews" WHERE (order_id = 1)