app/views/product/prod_cat.html.erb

<% @cats.each do |cat| %>
<h2> Listing product details for category <%=Cat.find(cat).category_name %> </h2>
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 1]]

		<%# #puts "category = #{cat}" %>
		<%product = Product.where('category = ?', cat) %>
---
SELECT "products".* FROM "products" WHERE (category = 1)