app/views/product/recent_order.html.erb

	<% end %>
		<td> <%= order.order_date %> </td>
		<td> <%= order.order_number %> </td>
		<td> <%= Lineitemnew.where('order_id = ?',order.id).count %> </td>
---
SELECT "orders".* FROM "orders"  ORDER BY order_date DESC
SELECT COUNT(*) FROM "lineitemnews" WHERE (order_id = 14)