app/controllers/product_controller.rb

SELECT "products".* FROM "products"
SELECT "products"."price" FROM "products"
SELECT "products"."price", "products"."unit" FROM "products"
---
  def detail
  	@products = Product.all
  	@total_product_price = Product.pluck(:price).inject(:+)

  	product_quantities = Product.pluck(:price,:unit)

SELECT "products".* FROM "products"  ORDER BY "products"."price" ASC
---
  def asc_price
  @asc_products = Product.order(:price)

SELECT "products".* FROM "products"  ORDER BY "products"."price" ASC, "products"."desc" ASC
---
  def des_price
  @dsc_products = Product.order('price DESC')

SELECT "products".* FROM "products" WHERE (in_stock = 't')
SELECT COUNT(*) FROM "products" WHERE (in_stock = 't')
---
  def in_stock
  @products = Product.where('in_stock = ?',true)
  #@products = Product.where(in_stock: true)
  @count = Product.where('in_stock = ?',true).count

SELECT "products".* FROM "products" WHERE (in_stock = 'f')
SELECT COUNT(*) FROM "products" WHERE (in_stock = 't')
---
  def out_stock
  @products = Product.where('in_stock = ?' ,false)
  @count = Product.where('in_stock = ?',false).count

SELECT "products".* FROM "products" WHERE (available_from <= '2016-07-17')
---
  def available
  @products = Product.where('available_from <= ?', Date.today)

SELECT "products".* FROM "products" WHERE (available_from > '2016-07-17')
---
  def not_available
  @products = Product.where('available_from > ?', Date.today)

SELECT "cats"."id" FROM "cats"
---
  def prod_cat
  	@cats = Cat.pluck(:id)

SELECT "orders".* FROM "orders"
---
  def orders_placed
    @orders = Order.all

SELECT "orders"."id" FROM "orders"
---
  def line_item_details
    @orders = Order.pluck(:id)

SELECT  "orders".* FROM "orders"  ORDER BY order_date DESC LIMIT 10
---
  def recent_order
    @orders = Order.order('order_date DESC').limit(10)